friendbook-backend/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "comments" SET "likes" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["likes", 1], ["updated_at", "2020-10-21 20:07:50.918752"], ["id", 13]]
---
    def update
        comment = Comment.find(params[:id])
        comment.update(comment_params)

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def destroy
        comment = Comment.find(params[:id])