friendbook-backend/app/controllers/posts_controller.rb

    def create
        post = Post.create(params[:id])
---
INSERT INTO "posts" ("post", "likes", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["post", "dasdasd"], ["likes", 0], ["user_id", 5], ["created_at", "2020-10-21 20:02:17.175000"], ["updated_at", "2020-10-21 20:02:17.175000"]]

    def update
        post = Post.find(params[:id])
        post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
UPDATE "posts" SET "post" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["post", "Hi there "], ["updated_at", "2020-10-22 15:14:32.611621"], ["id", 47]]

    def destroy
        post = Post.find(params[:id])
        post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 15]]